##Dyskretny sygnał 𝑥∈𝑅59 został przetworzony przez dyskretny nierekursywny układ liniowy o odpowiedź impulsowej ℎ∈𝑅25. 
##Znajdź dyskretny sygnał 𝑦[𝑛] będący sygnałem wyjściowym z tego układu. Jako rozwiązanie podaj moc otrzymanego sygnału.

function rozwiazanie(;
    ##wynik: 25.278427599305562 cos nie dziala
    ##x::Vector{Float64} = [2.22, 0.7, 4.74, -1.86, 1.41, 2.24, -0.24, -3.15, -4.37, 0.52, -4.18, -2.04, 3.09, 0.2, -4.68, -0.93, -0.93, -4.15, 0.55, -3.79, 4.82, 4.68, 0.83, 4.86, -3.56, 0.97, 4.4, -2.17, 4.24, 3.35, 1.01, 2.88, 0.45, 2.19, 1.51, -3.42, 1.32, 4.99, 2.43, -3.96, 0.0, -4.63, 0.87, 3.86, 4.47, 2.78, -4.88, 0.78, 4.7, 2.71, 0.34, -0.09, 2.77],
    ##h::Vector{Float64} = [-3.95, 1.42, 1.15, -1.84, -2.6, -4.52, 3.56, 2.63, 3.24, -0.75, 3.24],

    ## wynik: 1185.2445440109639 dziala
    x::Vector{Float64} = [-4.52, 4.21, 2.53, -3.28, -3.65, -1.69, -1.46, 3.63, 1.19, -0.61, 1.4, -4.83, -4.68, 4.4, -3.26, 1.32, 2.19, 2.14, 3.51, -3.65, -3.78, -0.8, -2.68, 0.01, -1.14, -3.71, -4.58, 3.82, 3.77, 4.29, 3.88, 2.3, 1.29, 3.05, 2.17, 0.85, -0.59, 1.84, 2.6, -3.48, 1.05, 2.38, 2.82, 2.73, -1.88, 2.32, 1.22, -3.37, 0.94, 4.22, 3.31, 4.84, -3.09, -4.79, 2.7, 2.98, -0.57, -1.73, 0.45],
    h::Vector{Float64} = [1.41, 2.17, 2.36, 0.15, -1.63, 0.58, -0.65, -4.13, 4.24, 3.74, -4.34, 3.01, 1.21, 4.99, 0.46, 2.96, 2.04, -4.91, 4.01, 3.0, -1.07, -4.8, -0.94, 0.02, -3.55],
)
    X = length(x)
    H = length(h)
    y = zeros(X+H-1)
    for i in 1:length(y)
        for j in 1:X
            if i-j+1 > 0 && i-j+1 <= H
                y[i] += x[j]*h[i-j+1]
            end
        end
    end

    power = 1/length(y)*sum(abs2.(y))
    #energy = sum(abs2.(y))
    return power
end

println(rozwiazanie())